More mermaid
Signed-off-by: Rick Taylor <rtaylor@aalyria.com>
